// Можно менять
let firstName = 'Gafar' 
let num = 42 //number

// Нельзя менять
const isProgrammer = true


let ten = '10' = 10; // присвоение
let five = '5' == 5; // нестрогое сравнение смотрит не на тип данных
let six = '6' === 6; // строгое сравнение сравнивает типы данных

typeof //определяет какой это тип данных


// Логические операторы 

/*
let logic = {
    || // или
    && // и
    ! // не
    ?? // опертор нулевого слияния (если есть null или underfined то он не берет их в расчет)
}
*/

new Date() // создает дату,время и т.д.

